//*****************************************************************************
//
// Имя файла    : 'buzzer.cpp'
// Заголовок    : Драйвер базера
// Автор        : Барышников Р. А.
// Контакты     : plexus_bra@rambler.ru
// Дата         : 15.10.2013
//
//*****************************************************************************

#include <unistd.h>
#include <mutex>

#include "gpio.h"
#include "buzzer.h"

// =============================================================================
//                                 Отладка
// =============================================================================

// =============================================================================
//                                Костанты
// =============================================================================

//  вывод
#define		BUZZER		13

// =============================================================================
//                                 Макросы
// =============================================================================

// =============================================================================
//                           Глобальные переменные
// =============================================================================

pthread_t thrBuz;
int g_delay;
int g_time;
int g_isCicle;

// =============================================================================
//                             Прототипы функций
// =============================================================================

void* buz(void* vptr_args)
{
	while(true)
	{
		while (g_isCicle)
		{
			g_isCicle = 0;
			GPIOSet(BUZZER);
			for (int i = 0; i < g_time; ++i)
			{
				usleep(1000);
			}
			GPIOClr(BUZZER);
		}
	}
}

int BuzInit (void)
{
	GPIOInit(BUZZER);

	g_isCicle = 0;
	if (pthread_create(&thrBuz, NULL, buz, NULL) != 0)
	{
		return EXIT_FAILURE;
	}
	return 0;
}

int beep (int timeOn, int delay)
{
	g_time = timeOn;
	g_delay = delay;
	g_isCicle = 1;
	return 0;
}
