#pragma once
//---------------------------Установка нужных параметров----------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//#define FROM_FILE1    //Захват видео не с камеры, а с видеофайла. 
						//Не нужно для выполнения на ODROID.
					    //Отключить (закомментировать для полёта).
//----------------------------------------------------------------------------------------------------
#define CAMERA1	//////////Захват видео с 1-ой камеры.

#if (defined( CAMERA1) || defined (FROM_FILE1))
#define NCam1 6 //Номер первой камеры.
// #define WRITE_ALG_CAMERA1 //Записывать видео с работой алгоритма распознавания с 1-ой камеры.
// #define WRITE_CAMERA1 //Записывать просто видео (без работы алгоритма) распознавания с 1-ой камеры.
#endif

// #define OUTPUT_CONSOLE //Вывод сообщений на консоль.
//----------------------------------------------------------------------------------------------------
// #define SHOW_WINDOWS //Показывать окошки в реальном времени. Нужно отключить (закомментировать) для полёта.
// #define OUTPUT_CONSOLE_FRAME_RES //Вывод на консоль результатов поиска для каждого кадра. 
								 //Нужно отключить (закомментировать) для полёта.
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------