//*****************************************************************************
//
// Имя файла    : 'motion.h'
// Заголовок    : Драйвер двигателей
// Автор        : Барышников Р. А.
// Контакты     : plexus_bra@rambler.ru
// Дата         : 27.09.2013
//
//*****************************************************************************

#ifndef _MOTION_H
#define _MOTION_H

#include "thread_wheel.h"

// =============================================================================
//                                Костанты
// =============================================================================

enum EDir
{
	FORWARD = 0,
	REVERSE
};

enum ETurn
{
	NORMAL = 0,
	AROUND
};

// =============================================================================
//                           Прототиаы функций
// =============================================================================

int motionInit (void);

int motionMove (EDir FORWARD);

int motionStop (void);

int motionLeft (ETurn NORMAL, EDir FORWARD);

int motionRight(ETurn NORMAL, EDir FORWARD);

void setSpeed(ESpeedWheel wheel, int value);

// =============================================================================
//                          Внешние зависимости
// =============================================================================

#endif // _MOTION_H